由多个Series组成的**Dataframe**——分析数据时候**最常使用的数据结构**
dataframe像由series组成的字典——像**表格**的形式
pd.DataFrame({列名:series,列名:series,列名:series,..})

In [3]:
import pandas as pd

创建DataFrame

In [8]:
s_id=pd.Series(["01","02","03","04","05"])
s_class=pd.Series(["二班","一班","二班","三班","一班"])
s_grade=pd.Series([92,67,70,88,76])

df1 = pd.DataFrame({"学号":s_id,"班级":s_class,"成绩":s_grade})
df1

   学号  班级  成绩
0  01  二班  92
1  02  一班  67
2  03  二班  70
3  04  三班  88
4  05  一班  76

创建有标签索引的DataFrame

In [10]:
s_id=pd.Series(["01","02","03","04","05"],index=["小明","小红","小杰","小丽","小华"])
s_class=pd.Series(["二班","一班","二班","三班","一班"],index=["小明","小红","小杰","小丽","小华"])
s_grade=pd.Series([92,67,70,88,76],index=["小明","小红","小杰","小丽","小华"])

df2 = pd.DataFrame({"学号":s_id,"班级":s_class,"成绩":s_grade})
df2

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88
小华  05  一班  76

或者创建嵌套字典

In [15]:
df3 = pd.DataFrame({"学号":{"小明":"01","小红":"02","小杰":"03","小丽":"04","小华":"05"},
                    "班级":{"小明":"二班","小红":"一班","小杰":"二班","小丽":"三班","小华":"一班"},
                    "成绩":{"小明":92,"小红":67,"小杰":70,"小丽":88,"小华":76}})
df3

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88
小华  05  一班  76

获取DataFrame的索引和列名、值——疑问dictionary object DataFrame的区别

In [16]:
df3.index

Index(['小明', '小红', '小杰', '小丽', '小华'], dtype='object')

In [13]:
df3.columns

Index(['学号', '班级', '成绩'], dtype='object')

In [17]:
df3.values

array([['01', '二班', 92],
       ['02', '一班', 67],
       ['03', '二班', 70],
       ['04', '三班', 88],
       ['05', '一班', 76]], dtype=object)

dataframe返回的值为numpy数组！所有对numpy数组的应用都可以用上

T——行列倒置

In [18]:
df3.T

    小明  小红  小杰  小丽  小华
学号  01  02  03  04  05
班级  二班  一班  二班  三班  一班
成绩  92  67  70  88  76

**提取DataFrame的列名**——Series：[] or 属性方式（如果属性名有空格等特殊符号则不可以属性名索引）

In [20]:
df3["学号"]

小明    01
小红    02
小杰    03
小丽    04
小华    05
Name: 学号, dtype: object

In [21]:
df3.班级

小明    二班
小红    一班
小杰    二班
小丽    三班
小华    一班
Name: 班级, dtype: object

提取多个列,记得双括号！！是在[]中传入列表的意思——返回的是DataFrame数据结构

In [23]:
df3[["学号","班级"]]

    学号  班级
小明  01  二班
小红  02  一班
小杰  03  二班
小丽  04  三班
小华  05  一班

**提DataFrame行**——用loc、iloc索引

In [24]:
df3.iloc[1]

学号    02
班级    一班
成绩    67
Name: 小红, dtype: object

In [25]:
df3.loc[["小丽","小红"]]

    学号  班级  成绩
小丽  04  三班  88
小红  02  一班  67

**提取部分DataFrame**——提取连续的行列切片，提取部分、提取不想邻的

In [27]:
df3.loc["小丽":"小华","班级":"成绩"]

    班级  成绩
小丽  三班  88
小华  一班  76

In [29]:
df3.iloc[0:2,0:3]

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67

In [31]:
df3.iloc[:,1:3]

    班级  成绩
小明  二班  92
小红  一班  67
小杰  二班  70
小丽  三班  88
小华  一班  76

In [33]:
df3.iloc[[1,4],1:3]

    班级  成绩
小红  一班  67
小华  一班  76

**条件筛选DataFrame的行**——每一行代表一个实例，每一列代表数据实例的属性
& | ~

In [35]:
df3.成绩>80

小明     True
小红    False
小杰    False
小丽     True
小华    False
Name: 成绩, dtype: bool

In [34]:
df3[df3.成绩>80]

    学号  班级  成绩
小明  01  二班  92
小丽  04  三班  88

In [36]:
df3[(df3.成绩>80) & (df3.班级=="三班")]

    学号  班级  成绩
小丽  04  三班  88

**head：获得DataFrame的前N行**——一般是前五航，可传入参数来指定行数

In [37]:
df3.head(3)

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70